{"pages":[{"title":"About","text":"🤔 Personal “blog” where I just dump whatever that’s on my mind to. Checkout the News category for updates and stuff.","link":"/about/"}],"posts":[{"title":"Cypher news","text":"[2021-08-27]There are currently no updates. Check again in a few months. Programming is hard and brain rotting.","link":"/2020-03/Cypher-news/"},{"title":"Holy","text":"","link":"/2021-08/Holy/"},{"title":"default threads permissions lmao","text":"","link":"/2021-08/default-threads-permissions-lmao/"},{"title":"fumo","text":"hype","link":"/2021-08/fumo/"},{"title":"hello","text":"Perhaps I will ditch twitter after I set this up correctly.","link":"/2021-08/hello/"},{"title":"time waste","text":"Spent an entire day figuring out how to do cython but turns out a shell script is sufficient.","link":"/2021-08/time-waste/"},{"title":"moment","text":"Gotta love losing motivation for about everything in like a singular day","link":"/2021-09/moment/"},{"title":"osu rambling","text":"Old configsmy current driver config when the pain","link":"/2021-09/osu-rambling/"},{"title":"timetable!","text":"timetable is now updated to 2021, see it here","link":"/2021-09/timetable/"},{"title":"Domain change","text":"I lost my cloudflare and namecheap account after i reset my yubikey’s fido applet because macos gpg tools was being extremely bad at handlingssh fido keys and gpg, resulting in my yubikey not being usable as a smartcard in macos, which was the only os i had access to(found out about t2linux much MUCH later). i had to ssh into multiple servers and my key was the only option. fuck you apple. anyways, i bought a new domain after the kcomain.dev domain was about to expire coincidentally (like a week earlier). it is this domain, soopy.moe.i don’t control the kcomain.dev domain anymore, please do not send any more emails to that address because i will not be reading them (improvmx onlyallows 1 domain at a time and setting it up is a major chore) haven’t got the time to setup all the old stuff back to my current domain (tbh most of the old stuff are not working anyways so you shouldn’t need to care) a list of my currently open services can be found here","link":"/2021-11/Domain-change/"},{"title":"we love hp","text":"sometimes linux just doesn’t work and you have a hard time finding why. this happened to my friend today because theirpc doesn’t work well with linux. it took them like 3 days before figuring out a possible solution. their problem was every single distro shows a black screen and nothing else. They tried Ubuntu, Endeavour and Manjaroand all gave them the black screen treatment. Solution: add noapic to kernel command line.","link":"/2022-02/we-love-hp/"},{"title":"openssh update","text":"Another month, another update. This time, OpenSSH decided to add a key-exchangealgorithm that just so happens to break my GPG+YubiKey ssh setup. Said kex algorithm is sntrup761x25519-sha512@openssh.com. If you don’t removeit, any attempts to connect to the server with the “current” yubikey (I have a5.2.7 yubikey) will result in the scdaemon spitting a not-at-all helpful errormessage at you: 1gpg-agent[1074]: scdaemon[1074]: app_auth failed: Invalid value This was a bit confusing and took me a while to figure out why it happens^2, evenwith gpg-agent set to output all information possible. Solution^1: 12# /etc/ssh/sshd_config+ KexAlgorithms -sntrup761x25519-sha512@openssh.com It’s worth noting that this config only applies to sshd. If you’re a client tryingto connect to a remote server that doesn’t have this, it will not work. I’m not sureif this is patched yet.","link":"/2022-04/openssh-update/"}],"tags":[{"name":"Cypher","slug":"Cypher","link":"/tags/Cypher/"},{"name":"Touhou Project","slug":"Touhou-Project","link":"/tags/Touhou-Project/"},{"name":"Fumo","slug":"Fumo","link":"/tags/Fumo/"},{"name":"Discord","slug":"Discord","link":"/tags/Discord/"},{"name":"Threads","slug":"Threads","link":"/tags/Threads/"},{"name":"Coding","slug":"Coding","link":"/tags/Coding/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"Games","slug":"Games","link":"/tags/Games/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"OpenSSH","slug":"OpenSSH","link":"/tags/OpenSSH/"}],"categories":[{"name":"News","slug":"News","link":"/categories/News/"},{"name":"Image","slug":"Image","link":"/categories/Image/"},{"name":"Text-only","slug":"Text-only","link":"/categories/Text-only/"}]}